ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad5940_eda/eda_application_task.c
/**
***************************************************************************
* @addtogroup Tasks
* @{
* @file         eda_application_task.c
* @author       ADI
* @version      V1.0.0
* @date         26-June-2019
* @brief        Source file contains EDA processing wrapper.
***************************************************************************
* @attention
***************************************************************************
*/
/*!
*  copyright Analog Devices
* ****************************************************************************
*
* License Agreement
*
* Copyright (c) 2020 Analog Devices Inc.
* All rights reserved.
*
* This source code is intended for the recipient only under the guidelines of
* the non-disclosure agreement with Analog Devices Inc.
*

* THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
* EXPRESS OR  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
* IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
* CLAIM, DAMAGES OR OTHER  LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
* TORT OR OTHERWISE, ARISING  FROM, OUT OF OR IN CONNECTION WITH THE
* SOFTWARE OR THE USE OR OTHER  DEALINGS IN THE SOFTWARE.
* ****************************************************************************
*/
#ifdef ENABLE_EDA_APP
#include "eda_application_task.h"
#include <adpd4000_dcfg.h>
#include <ecg_task.h>
#include <includes.h>
#include <limits.h>
#include <power_manager.h>
#include <stdint.h>
#include <string.h>
#include "us_tick.h"

#ifdef VSM_MBOARD
#include "watch_vsm_motherboard_pin_config.h"
#elif PCBA
#include "watch_board_pcba_pin_config.h"
#else
#include "watch_board_evt_pin_config.h"
#endif
#include "nrf_drv_gpiote.h"

#include "nrf_log_ctrl.h"

/////////////////////////////////////////
#ifdef DCB
#include <adi_dcb_config.h>
#include <dcb_interface.h>
static volatile bool g_eda_dcb_Present = false;
bool eda_get_dcb_present_flag(void);
void eda_set_dcb_present_flag(bool set_flag);
EDA_ERROR_CODE_t read_eda_dcb(uint32_t *eda_dcb_data, uint16_t *read_size);
EDA_ERROR_CODE_t write_eda_dcb(uint32_t *eda_dcb_data, uint16_t write_Size);
EDA_ERROR_CODE_t delete_eda_dcb(void);
#endif
/////////////////////////////////////////

#define ADMITANCE_CARTESIAN_FORM

/* EDA app Task Module Log settings */
#define NRF_LOG_MODULE_NAME EDA_App_Task

#if EDA_APP_CONFIG_LOG_ENABLED
#ifdef NRF_LOG_DEFAULT_LEVEL
#undef NRF_LOG_DEFAULT_LEVEL
#define NRF_LOG_DEFAULT_LEVEL EDA_APP_CONFIG_LOG_LEVEL
#endif
#define NRF_LOG_INFO_COLOR EDA_APP_CONFIG_INFO_COLOR
#define NRF_LOG_DEBUG_COLOR EDA_APP_CONFIG_DEBUG_COLOR
#else /* EDA_TASK_CONFIG_LOG_ENABLED */
#define NRF_LOG_LEVEL 0
#endif /* EDA_TASK_CONFIG_LOG_ENABLED */
#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();

uint32_t temp;
#ifdef DEBUG_EDA
static uint32_t pkt_count = 0;
#endif

#ifdef PROFILE_TIME_ENABLED
static float eda_odr = 0, time_elapsed_for_eda = 0, eda_start_time = 0;
#endif

static _gEdaAd5940Data_t gEdaData = {{0}, 0, 0, 0};
extern uint32_t FifoCount;
extern uint64_t nTcv; /* timestamp */
uint32_t ResistorForBaseline = 0;
float magnitude, phase;
static int32_t SignalData[MAX_NUM_OF_FFT_POINTS] = {0}, eda_counter = 0;
uint8_t measurement_cycle_completed = 0;
uint8_t init_flag;
extern AD5950_APP_ENUM_t gnAd5940App;
extern volatile uint8_t gnAd5940DataReady;
extern uint8_t gnAd5940TimeIrqSet;
extern uint8_t gnAd5940TimeIrqSet1;

g_state_eda_t g_state_eda;
#ifdef EXTERNAL_TRIGGER_EDA
uint8_t eda_start_req=0;
#endif
AppEDACfg_Type AppEDACfg;
volatile int16_t eda_user_applied_odr = 0;
volatile int16_t eda_user_applied_dftnum = 0;
volatile int16_t eda_user_applied_rtia_cal = 0;
uint8_t rtia_cal_completed = 0;
extern uint32_t AppBuff[APPBUFF_SIZE];


#ifdef PROFILE_TIME_ENABLED
uint64_t delay_in_first_measurement;
uint64_t voltage_measurement_diff_time;
uint64_t current_measurement_diff_time;
uint64_t voltage_cycles_diff_time;
uint64_t current_cycles_diff_time;
extern uint64_t gnAd5940TimeCurVal;
extern uint64_t gnAd5940TimeCurValInMicroSec;
uint32_t eda_init_diff_time;
uint32_t eda_rtia_cal_diff_time;
uint32_t eda_init_start_time;
#endif

typedef m2m2_hdr_t *(app_cb_function_t)(m2m2_hdr_t *);

const char GIT_EDA_VERSION[] = "TEST EDA_VERSION STRING";
const uint8_t GIT_EDA_VERSION_LEN = sizeof(GIT_EDA_VERSION);
static void packetize_eda_raw_data(
    int32_t *SignalData, eda_app_stream_t *pPkt, uint32_t timestamp);
static m2m2_hdr_t *eda_app_reg_access(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *eda_app_stream_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *eda_app_status(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *eda_app_get_version(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *eda_app_decimation(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *eda_app_dynamic_scaling(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *eda_app_dft_num_set(m2m2_hdr_t *p_pkt);
#ifdef DEBUG_EDA
static m2m2_hdr_t *eda_app_debug_info(m2m2_hdr_t *p_pkt);
#endif
static m2m2_hdr_t *eda_app_perform_rtia_calibration(m2m2_hdr_t *p_pkt);
#ifdef DCB
static m2m2_hdr_t *eda_app_set_dcb_lcfg(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *eda_dcb_command_read_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *eda_dcb_command_write_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *eda_dcb_command_delete_config(m2m2_hdr_t *p_pkt);
#endif
#ifdef AD5940_REG_ACCESS
static m2m2_hdr_t *ad5940_app_reg_access(m2m2_hdr_t *p_pkt);
#endif
static void fetch_eda_data(void);
static void sensor_eda_task(void *pArgument);
void Enable_ephyz_power(void);
uint32_t ad5940_port_deInit(void);

uint8_t sensor_eda_task_stack[APP_OS_CFG_EDA_TASK_STK_SIZE];
ADI_OSAL_THREAD_HANDLE sensor_eda_task_handler;
ADI_OSAL_STATIC_THREAD_ATTR sensor_eda_task_attributes;
StaticTask_t edaTaskTcb;
ADI_OSAL_SEM_HANDLE eda_task_evt_sem;

/*!
 * @brief:  The dictionary type for mapping addresses to callback handlers.
 */
typedef struct _app_routing_table_entry_t {
  uint8_t command;
  app_cb_function_t *cb_handler;
} app_routing_table_entry_t;

app_routing_table_entry_t eda_app_routing_table[] = {
    {M2M2_APP_COMMON_CMD_STREAM_START_REQ, eda_app_stream_config},
    {M2M2_APP_COMMON_CMD_STREAM_STOP_REQ, eda_app_stream_config},
    {M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_REQ, eda_app_stream_config},
    {M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_REQ, eda_app_stream_config},
    {M2M2_APP_COMMON_CMD_SENSOR_STATUS_QUERY_REQ, eda_app_status},
    {M2M2_APP_COMMON_CMD_READ_LCFG_REQ, eda_app_reg_access},
    {M2M2_APP_COMMON_CMD_WRITE_LCFG_REQ, eda_app_reg_access},
    {M2M2_SENSOR_COMMON_CMD_GET_STREAM_DEC_FACTOR_REQ, eda_app_decimation},
    {M2M2_SENSOR_COMMON_CMD_SET_STREAM_DEC_FACTOR_REQ, eda_app_decimation},
    {M2M2_APP_COMMON_CMD_GET_VERSION_REQ, eda_app_get_version},
    {M2M2_EDA_APP_CMD_DYNAMIC_SCALE_REQ, eda_app_dynamic_scaling},
    {M2M2_EDA_APP_CMD_RTIA_CAL_REQ, eda_app_perform_rtia_calibration},
#ifdef DEBUG_EDA
    {M2M2_EDA_APP_CMD_REQ_DEBUG_INFO_REQ, eda_app_debug_info},
#endif
    {M2M2_EDA_APP_CMD_SET_DFT_NUM_REQ, eda_app_dft_num_set},
#ifdef DCB
    {M2M2_APP_COMMON_CMD_SET_LCFG_REQ, eda_app_set_dcb_lcfg},
    {M2M2_DCB_COMMAND_READ_CONFIG_REQ, eda_dcb_command_read_config},
    {M2M2_DCB_COMMAND_WRITE_CONFIG_REQ, eda_dcb_command_write_config},
    {M2M2_DCB_COMMAND_ERASE_CONFIG_REQ, eda_dcb_command_delete_config},
#endif
#ifdef AD5940_REG_ACCESS
    {M2M2_SENSOR_COMMON_CMD_READ_REG_16_REQ, ad5940_app_reg_access},
    {M2M2_SENSOR_COMMON_CMD_WRITE_REG_16_REQ, ad5940_app_reg_access},
#endif
};

#define EDA_APP_ROUTING_TBL_SZ                                                 \
  (sizeof(eda_app_routing_table) / sizeof(eda_app_routing_table[0]))

ADI_OSAL_QUEUE_HANDLE eda_task_msg_queue = NULL;

#ifdef USER0_CONFIG_APP
#include "user0_config_app_task.h"
#include "app_timer.h"
#include "low_touch_task.h"
APP_TIMER_DEF(m_eda_timer_id);     /**< Handler for repeated timer for EDA. */
static void eda_timer_start(void);
static void eda_timer_stop(void);
static void eda_timeout_handler(void * p_context);
void start_eda_app_timer();
static user0_config_app_timing_params_t eda_app_timings = {0};
static volatile uint8_t gnDoEdaStart = 0; //Flag to do EDAInit() from task context
static volatile uint8_t gnDoEdaStop = 0;  //Flag to do EDADeInit() from task context

/**@brief Function for the Timer initialization.
*
* @details Initializes the timer module. This creates and starts application timers.
*
* @param[in]  None
*
* @return     None
*/
static void eda_timer_init(void)
{
    ret_code_t err_code;

    /*! Create timers */
    err_code =  app_timer_create(&m_eda_timer_id, APP_TIMER_MODE_REPEATED, eda_timeout_handler);

    APP_ERROR_CHECK(err_code);
}

/**@brief   Function for starting application timers.
* @details Timers are run after the scheduler has started.
*
* @param[in]  None
*
* @return     None
*/
static void eda_timer_start(void)
{
    /*! Start repeated timer */
    ret_code_t err_code = app_timer_start(m_eda_timer_id, APP_TIMER_TICKS(TIMER_ONE_SEC_INTERVAL), NULL);
    APP_ERROR_CHECK(err_code);

