ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad5940_eda/eda_application_task.c
    eda_app_timings.check_timer_started = true;
}

/**@brief   Function for stopping the application timers.
*
* @param[in]  None
*
* @return     None
*/
static void eda_timer_stop(void)
{
    /*! Stop the repeated timer */
    ret_code_t err_code = app_timer_stop(m_eda_timer_id);
    APP_ERROR_CHECK(err_code);

    eda_app_timings.check_timer_started = false;
}

/**@brief   Callback Function for application timer events
*
* @param[in]  p_context: pointer to the callback function arguments
*
* @return     None
*/
static void eda_timeout_handler(void * p_context)
{
    if(eda_app_timings.delayed_start && eda_app_timings.start_time>0)
    {
      eda_app_timings.start_time_count++; /*! Increment counter every sec., till it is equal to start_time Value in seconds. */
      if(eda_app_timings.start_time_count == eda_app_timings.start_time)
      {
        //delayed start time expired-turn ON EDA
        gnDoEdaStart = 1; //Do EDAInit() from task context
        adi_osal_SemPost(eda_task_evt_sem);//Intimate EDA task
        eda_app_timings.delayed_start = false;
        eda_app_timings.start_time_count = 0;
        eda_app_timings.app_mode_on = true;
      }
      return;
    }

    if(eda_app_timings.app_mode_on && eda_app_timings.on_time>0)
    {
        eda_app_timings.on_time_count++; /*! Increment counter every sec. incase of ADPD ON, till it is equal to Ton Value in seconds. */
        if(eda_app_timings.on_time_count == eda_app_timings.on_time)
        {
          //on timer expired - turn off EDA
          if (g_state_eda.num_starts == 1) {
              gnDoEdaStop = 1;//Do EDADeInit() from task context
              adi_osal_SemPost(eda_task_evt_sem);//Intimate EDA task
          }
          eda_app_timings.app_mode_on = false;
          eda_app_timings.on_time_count = 0;
        }
    }
    else if(!eda_app_timings.app_mode_on && eda_app_timings.off_time>0)
    {
      eda_app_timings.off_time_count++; /*! Increment counter every sec. incase of ADPD OFF, till it is equal to Toff Value in seconds.*/
      if(eda_app_timings.off_time_count == eda_app_timings.off_time)
        {
           //off timer expired - turn on EDA
           if (g_state_eda.num_starts == 1) {
               gnDoEdaStart = 1;
               adi_osal_SemPost(eda_task_evt_sem);//Intimate EDA task
           }
           eda_app_timings.app_mode_on = true;
           eda_app_timings.off_time_count = 0;
        }
    }
}

/**@brief   Function to start EDA app timer
* @details  This is used in either interval based/intermittent LT mode3
*
* @param[in]  None
*
* @return     None
*/
void start_eda_app_timer()
{
  if(eda_app_timings.on_time > 0)
  {
    eda_timer_start();
  }

}
#endif//USER0_CONFIG_APP

/*!
 ****************************************************************************
 *@brief      Initialize configurations for eda application
 *@param      None
 *@return     None
 ******************************************************************************/
void InitCfg() {
  AppEDACfg.bParaChanged = bTRUE;
  AppEDACfg.SeqStartAddr = 0;
  AppEDACfg.MaxSeqLen = 0;
  AppEDACfg.SeqStartAddrCal = 0;
  AppEDACfg.MaxSeqLenCal = 0;
  /* Application related parameters */
  AppEDACfg.bBioElecBoard = bTRUE;
  AppEDACfg.ReDoRtiaCal = bFALSE;
  AppEDACfg.SysClkFreq = 16000000.0;
  AppEDACfg.LfoscClkFreq = 32000.0;
  AppEDACfg.AdcClkFreq = 16000000.0;
  AppEDACfg.FifoThresh = 2;
  AppEDACfg.NumOfData = -1;
  AppEDACfg.VoltCalPoints = 8;
  AppEDACfg.RcalVal = 10000.0;          /* 10kOhm */
  AppEDACfg.SinFreq = 100.0;            /* 100Hz */
  AppEDACfg.SampleFreq = 400.0;         /* 400Hz */
  AppEDACfg.SinAmplitude = 1100.0f / 2; /* 1100mV peak */
  AppEDACfg.DacUpdateRate = 7;
  AppEDACfg.HanWinEn = bTRUE;
  AppEDACfg.RtiaIndexCurr = 0;
  AppEDACfg.RtiaIndexNext = 0;
  AppEDACfg.bChangeRtia = bFALSE;
  /* private variables */
  AppEDACfg.SeqPatchInfo.BuffLen = 32;
  AppEDACfg.SeqPatchInfo.pSeqCmd = NULL;
  AppEDACfg.ImpEDABase.Real = 0;
  AppEDACfg.ImpEDABase.Image = 0;
  AppEDACfg.ImpSum.Real = 0;
  AppEDACfg.ImpSum.Real = 0;
  AppEDACfg.EDAInited = bFALSE;
  AppEDACfg.StopRequired = bFALSE;
  AppEDACfg.bRunning = bFALSE;
  AppEDACfg.bMeasVoltReq = bFALSE;
  AppEDACfg.EDAStateCurr = EDASTATE_INIT;
  AppEDACfg.EDAStateNext = EDASTATE_INIT;
};

/* magnitude and phase */
/*!
 *************************************************************************************
 *@brief       Calculate EDA Impedance
 *@param       pData: Pointer to data buffer holding information about Impedance
               DataCount: data count/ fifo count
 *@return      AD5940Err
 ************************************************************************************/
fImpCar_Type *pImp;
AD5940Err EDACalculateImpedance(void *pData, uint32_t DataCount) {
  float RtiaMag;
  /* Process data */
  pImp = (fImpCar_Type *)pData;
  AppEDACtrl(EDACTRL_GETRTIAMAG, &RtiaMag);
  /* Process data */
  for (int i = 0; i < DataCount; i++) {
    fImpCar_Type res;
    res = pImp[i];
    /* Show the real result of impedance under test(between F+/S+) */
    res.Real += ResistorForBaseline;
#if defined(IMPEDANCE_POLAR_FORM)
    gEdaData.edaImpedenc.real = AD5940_ComplexMag(&res);
    gEdaData.edaImpedence.img = AD5940_ComplexPhase(&res) * 180 / MATH_PI;
#elif defined(IMPEDANCE_CARTESIAN_FORM)
    gEdaData.edaImpedence.real = res.Real;
    gEdaData.edaImpedence.img = res.Image;
#elif defined(ADMITANCE_POLAR_FORM)
    res.Real = res.Real / (res.Real * res.Real + res.Image * res.Image);
    res.Image = -res.Image / (res.Real * res.Real + res.Image * res.Image);
    gEdaData.edaImpedence.real = AD5940_ComplexMag(&res);
    gEdaData.edaImpedence.img = AD5940_ComplexPhase(&res) * 180 / MATH_PI;
#else
    gEdaData.edaImpedence.real =
        (res.Real / (float)(res.Real * res.Real + res.Image * res.Image)) *
        1000;
    gEdaData.edaImpedence.img =
        (-res.Image / (float)(res.Real * res.Real + res.Image * res.Image)) *
        1000;
#endif
    /* clear flag */
    measurement_cycle_completed = 0;
  }
  return 0;
}
/*!
 ****************************************************************************
 *@brief       Eda Task initialization
 *@param       None
 *@return      None
 ******************************************************************************/
void ad5940_eda_task_init(void) {
  /* Initialize app state */
  g_state_eda.num_subs = 0;
  g_state_eda.num_starts = 0;
  /* Default behaviour is to send every packet */
  g_state_eda.decimation_factor = 1;
  g_state_eda.decimation_nsamples = 0;
  g_state_eda.data_pkt_seq_num = 0;

  ADI_OSAL_STATUS eOsStatus = ADI_OSAL_SUCCESS;
  sensor_eda_task_attributes.pThreadFunc = sensor_eda_task;
  sensor_eda_task_attributes.nPriority = APP_OS_CFG_EDA_TASK_PRIO;
  sensor_eda_task_attributes.pStackBase = &sensor_eda_task_stack[0];
  sensor_eda_task_attributes.nStackSize = APP_OS_CFG_EDA_TASK_STK_SIZE;
  sensor_eda_task_attributes.pTaskAttrParam = NULL;
  sensor_eda_task_attributes.szThreadName = "EDA Sensor";
  sensor_eda_task_attributes.pThreadTcb = &edaTaskTcb;

