ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad5940_eda/eda_application_task.c
  eOsStatus = adi_osal_MsgQueueCreate(&eda_task_msg_queue, NULL, 5);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
    Debug_Handler();
  } else {
    update_task_queue_list(APP_OS_CFG_EDA_TASK_INDEX, eda_task_msg_queue);
  }
  eOsStatus = adi_osal_ThreadCreateStatic(
      &sensor_eda_task_handler, &sensor_eda_task_attributes);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
    Debug_Handler();
  }
  adi_osal_SemCreate(&eda_task_evt_sem, 0);
}

/*!
 ****************************************************************************
 *@brief      Called by the post office to send messages to this application
 *@param      p_pkt: packet of type m2m2_hdr_t
 *@return     None
 ******************************************************************************/
void send_message_ad5940_eda_task(m2m2_hdr_t *p_pkt) {
  ADI_OSAL_STATUS osal_result;
  osal_result = adi_osal_MsgQueuePost(eda_task_msg_queue, p_pkt);
  if (osal_result != ADI_OSAL_SUCCESS)
    post_office_consume_msg(p_pkt);
  adi_osal_SemPost(eda_task_evt_sem);
}

/*!
 ****************************************************************************
 *@brief      Eda Task
 *@param      None
 *@return     None
 ******************************************************************************/
static void sensor_eda_task(void *pArgument) {
  ADI_OSAL_STATUS err;
  post_office_add_mailbox(M2M2_ADDR_MED_EDA, M2M2_ADDR_MED_EDA_STREAM);

  /*Wait for FDS init to complete*/
  adi_osal_SemPend(eda_task_evt_sem, ADI_OSAL_TIMEOUT_FOREVER);

#ifdef USER0_CONFIG_APP
  eda_timer_init();
#endif

  while (1) {
    m2m2_hdr_t *p_in_pkt = NULL;
    m2m2_hdr_t *p_out_pkt = NULL;
    adi_osal_SemPend(eda_task_evt_sem, ADI_OSAL_TIMEOUT_FOREVER);
    p_in_pkt =
        post_office_get(ADI_OSAL_TIMEOUT_NONE, APP_OS_CFG_EDA_TASK_INDEX);
    if (p_in_pkt == NULL) {
#ifndef EXTERNAL_TRIGGER_EDA
       if(g_state_eda.num_starts != 0) /* Fetch data from device only if the device is in active state(initialized properly)*/
          fetch_eda_data();
#else
      /* No m2m2 messages to process, so fetch some data from the device */
      if(g_state_eda.num_starts != 0){ /* Fetch data from device only if the device is in active state(initialized properly)*/
           /* Now there should be fifo data ; number of samples to read is being set in
        eds app which FIFO threshold variable*/

          /* set ISR flags high */
          gnAd5940DataReady = 1;
          gnAd5940TimeIrqSet = 1;
          gnAd5940TimeIrqSet1 = 1;
          fetch_eda_data();
        }
#endif
        else{
          /* false trigger */
        }
#ifdef USER0_CONFIG_APP
    } if(gnDoEdaStart && (g_state_eda.num_starts == 1)) {
       gnDoEdaStart = 0;
       if(EDA_SUCCESS == EDAAppInit())
       {
       }
    } if(gnDoEdaStop && (g_state_eda.num_starts == 1)) {
       gnDoEdaStop = 0;
       if(EDA_SUCCESS == EDAAppDeInit())
       {
       }
    } if (p_in_pkt != NULL) {
#else
    } else {
#endif //USER0_CONFIG_APP
      /* Got an m2m2 message from the queue, process it */
      PYLD_CST(p_in_pkt, _m2m2_app_common_cmd_t, p_in_cmd);
      /* Look up the appropriate function to call in the function table */
      for (int i = 0; i < EDA_APP_ROUTING_TBL_SZ; i++) {
        if (eda_app_routing_table[i].command == p_in_cmd->command) {
          p_out_pkt = eda_app_routing_table[i].cb_handler(p_in_pkt);
          break;
        }
      }
      post_office_consume_msg(p_in_pkt);
      if (p_out_pkt != NULL) {
        post_office_send(p_out_pkt, &err);
        NRF_LOG_INFO("EDA status packets sent");
      }
    }
  }
}

/*!
 ****************************************************************************
 *@brief      Packetize eda data
 *@param      pSignalData: pointer to the eda data
 *@param      pPkt: pointer to the packet structure
 *@param      timestamp: timestamp of the packet
 *@return     None
 ******************************************************************************/
static void packetize_eda_raw_data(
    int32_t *SignalData, eda_app_stream_t *pPkt, uint32_t timestamp) {
  /*   Calculate Impedance in form of Cartesian form */
  EDACalculateImpedance(&SignalData[0], FifoCount);
  if (g_state_eda.eda_pktizer.packet_nsamples == 0) {
    g_state_eda.eda_pktizer.packet_max_nsamples =
        (sizeof(pPkt->eda_data) / sizeof(pPkt->eda_data[0]));
    pPkt->eda_data[0].timestamp = timestamp;
    pPkt->eda_data[0].realdata = (int16_t)(gEdaData.edaImpedence.real / 1000);
    pPkt->eda_data[0].imgdata = (int16_t)(gEdaData.edaImpedence.img / 1000);
    g_state_eda.eda_pktizer.packet_nsamples++;
  } else if (g_state_eda.eda_pktizer.packet_nsamples <
             g_state_eda.eda_pktizer.packet_max_nsamples) {
    /* one packet =  6 samples
     * first sample is added in above check and
     *  remaining 5 samples is added here */
    uint16_t i = g_state_eda.eda_pktizer.packet_nsamples;
    pPkt->eda_data[i].timestamp = timestamp;
    pPkt->eda_data[i].realdata = (int16_t)(gEdaData.edaImpedence.real / 1000);
    pPkt->eda_data[i].imgdata = (int16_t)(gEdaData.edaImpedence.img / 1000);
    g_state_eda.eda_pktizer.packet_nsamples++;
  }
}

/*!
 ****************************************************************************
 *@brief      Reset eda packetization
 *@param      None
 *@return     None
 ******************************************************************************/
static void reset_eda_packetization(void) {
  g_state_eda.eda_pktizer.packet_nsamples = 0;
}

/*!
 ****************************************************************************
 *@brief      Fetch eda data
 *@param      None
 *@return     None
 ******************************************************************************/
static void fetch_eda_data(void) {
  ADI_OSAL_STATUS err;
  uint32_t edaTS = 0;
  int8_t status = 0;
  static uint32_t edaData = 0;
  static eda_app_stream_t pkt;
  g_state_eda.eda_pktizer.p_pkt = NULL;
  temp = APPBUFF_SIZE;
  AppEDAISR(AppBuff, &temp);
  status = ad5950_buff_get((uint32_t *)&edaData, &edaTS);

  /* reading a pair of samples for impedance calculation */
  SignalData[eda_counter++] = edaData;
  if (eda_counter > FifoCount / 2) {
    eda_counter = 0;
  }
  while ((status == AD5940Drv_SUCCESS) && (eda_counter == FifoCount / 2)) {
    g_state_eda.decimation_nsamples++;

    if (g_state_eda.decimation_nsamples >= g_state_eda.decimation_factor) {
      g_state_eda.decimation_nsamples = 0;
      packetize_eda_raw_data(SignalData, &pkt, edaTS);
      if (g_state_eda.eda_pktizer.packet_nsamples >=
          g_state_eda.eda_pktizer.packet_max_nsamples) {
        adi_osal_EnterCriticalRegion();
        g_state_eda.eda_pktizer.p_pkt =
            post_office_create_msg(sizeof(eda_app_stream_t) + M2M2_HEADER_SZ);
        if (g_state_eda.eda_pktizer.p_pkt != NULL) {
          PYLD_CST(
              g_state_eda.eda_pktizer.p_pkt, eda_app_stream_t, p_payload_ptr);
          g_state_eda.eda_pktizer.p_pkt->src = M2M2_ADDR_MED_EDA;
          g_state_eda.eda_pktizer.p_pkt->dest = M2M2_ADDR_MED_EDA_STREAM;
          memcpy(&p_payload_ptr->command, &pkt, sizeof(eda_app_stream_t));
          p_payload_ptr->command = M2M2_SENSOR_COMMON_CMD_STREAM_DATA;
          p_payload_ptr->status = 0x00;
          p_payload_ptr->datatype = M2M2_SENSOR_EDA_DATA;
          g_state_eda.eda_pktizer.p_pkt->src = M2M2_ADDR_MED_EDA;
          g_state_eda.eda_pktizer.p_pkt->dest = M2M2_ADDR_MED_EDA_STREAM;
          p_payload_ptr->sequence_num = g_state_eda.data_pkt_seq_num++;
#ifdef DEBUG_PKT
          post_office_msg_cnt(g_state_eda.eda_pktizer.p_pkt);
#endif
#ifdef USER0_CONFIG_APP
          if(eda_app_timings.app_mode_on)
          {
#endif //USER0_CONFIG_APP
          post_office_send(g_state_eda.eda_pktizer.p_pkt, &err);
#ifdef USER0_CONFIG_APP
          }//if(eda_app_timings.app_mode_on)
          else
            post_office_consume_msg(g_state_eda.eda_pktizer.p_pkt);
#endif //USER0_CONFIG_APP
#ifdef PROFILE_TIME_ENABLED
          time_elapsed_for_eda = MCU_HAL_GetTick() - eda_start_time;
#endif
#ifdef DEBUG_EDA
          pkt_count++;
          eda_odr = ((pkt_count * 6 * 1000) / time_elapsed_for_eda);
          NRF_LOG_INFO("TIME ELAPSED = " NRF_LOG_FLOAT_MARKER,
              NRF_LOG_FLOAT(time_elapsed_for_eda));
          NRF_LOG_INFO("START TIME = " NRF_LOG_FLOAT_MARKER,
              NRF_LOG_FLOAT(eda_start_time));
          NRF_LOG_INFO("EDA MEASURED ODR = " NRF_LOG_FLOAT_MARKER,
              NRF_LOG_FLOAT(eda_odr));
#endif
          g_state_eda.eda_pktizer.packet_nsamples = 0;
          g_state_eda.eda_pktizer.packet_max_nsamples = 0;
          g_state_eda.eda_pktizer.p_pkt = NULL;
        }
        adi_osal_ExitCriticalRegion(); /* exiting critical region even if
                                          mem_alloc fails*/
      }
    } /* Copy data from circular buffer data to soft buffer*/
    status = ad5950_buff_get((uint32_t *)&edaData, &edaTS);
    SignalData[eda_counter++] = edaData;
  }
}

/*!
 ****************************************************************************
 *@brief      Get eda application version
 *@param      pPkt: pointer to the packet structure
 *@return     m2m2_hdr_t
 ******************************************************************************/
static m2m2_hdr_t *eda_app_get_version(m2m2_hdr_t *p_pkt) {
  /*  Allocate memory to response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_app_common_version_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_app_common_version_t, p_resp_payload);

    p_resp_payload->command = M2M2_APP_COMMON_CMD_GET_VERSION_RESP;
    p_resp_payload->major = 0x03;
    p_resp_payload->minor = 0x04;
    p_resp_payload->patch = 0x03;
    memcpy(&p_resp_payload->verstr[0], "EDA_App", 8);
    memcpy(&p_resp_payload->str[0], &GIT_EDA_VERSION, GIT_EDA_VERSION_LEN);
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

uint32_t const RtiaTable[] = {0, 110, 1000, 2000, 3000, 4000, 6000, 8000, 10000,
    12000, 16000, 20000, 24000, 30000, 32000, 40000, 48000, 64000, 85000, 96000,
    100000, 120000, 128000, 160000, 196000, 256000, 512000};

/*!
 ****************************************************************************
 *@brief      Perform RTIA calibration
 *@param      pPkt: pointer to the packet structure
 *@return     m2m2_hdr_t
 ******************************************************************************/
static m2m2_hdr_t *eda_app_perform_rtia_calibration(m2m2_hdr_t *p_pkt) {
  uint16_t num_cal_points = 0;
  uint8_t index = 0;

