ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad5940_eda/eda_application_task.c
  /* Declare a pointer to the input packet payload */
  PYLD_CST(p_pkt, eda_app_perform_rtia_cal_t, p_in_payload);
  num_cal_points = p_in_payload->maxscale - p_in_payload->minscale + 1;

  /* Allocate a response packet with space for the correct number of operations
   */
  PKT_MALLOC(p_resp_pkt, eda_app_perform_rtia_cal_t,num_cal_points * sizeof(p_in_payload->rtia_cal_table_val[0]));
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, eda_app_perform_rtia_cal_t, p_resp_payload);

    p_resp_payload->command = M2M2_EDA_APP_CMD_RTIA_CAL_RESP;
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
    p_resp_payload->minscale = p_in_payload->minscale;
    p_resp_payload->maxscale = p_in_payload->maxscale;
    p_resp_payload->lowpowerrtia = p_in_payload->lowpowerrtia;

    /* LDO power on */
    adp5360_enable_ldo(ECG_LDO, true);


    /* Initilaize eda app configuration */
    InitCfg();

    AppEDACfg.RtiaAutoScaleMin = p_in_payload->minscale;
    AppEDACfg.RtiaAutoScaleMax = p_in_payload->maxscale;
    AppEDACfg.LptiaRtiaSel = p_in_payload->lowpowerrtia;
    rtia_cal_completed = 0;

    /* avoid re-init of eda configuration */
    init_flag=0;

    /* start eda sensor */
    ad5940_eda_start();

    /* Waiting for rtia calibration to get over */
    while (!rtia_cal_completed) {
      MCU_HAL_Delay(1000);
    }
    NRF_LOG_INFO("Calibration started");

    int i = AppEDACfg.RtiaAutoScaleMin;
    for (; i <= AppEDACfg.RtiaAutoScaleMax; i++) {
      p_resp_payload->rtia_cal_table_val[index].calibrated_res = (uint32_t)AD5940_ComplexMag(&AppEDACfg.RtiaCalTable[i]);
      p_resp_payload->rtia_cal_table_val[index].actual_res = RtiaTable[i];
      NRF_LOG_INFO("%d:%d",
          p_resp_payload->rtia_cal_table_val[index].actual_res,
          p_resp_payload->rtia_cal_table_val[index].calibrated_res);
      index++;
    }

    p_resp_payload->num_calibrated_values = num_cal_points;

    /* LDO power off */
    adp5360_enable_ldo(ECG_LDO, false);
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  } // if(NULL != p_resp_pkt)
  return p_resp_pkt;
}

/*!
 ******  **********************************************************************
 *@brief      Get eda application status (subscribers and start requests)
 *@param      pPkt: pointer to the packet structure
 *@return     m2m2_hdr_t
 ******************************************************************************/
static m2m2_hdr_t *eda_app_status(m2m2_hdr_t *p_pkt) {
  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_app_common_status_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_app_common_status_t, p_resp_payload);

    p_resp_payload->command = M2M2_APP_COMMON_CMD_SENSOR_STATUS_QUERY_RESP;
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;
    if (g_state_eda.num_starts == 0) {
      p_resp_payload->status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
    } else {
      p_resp_payload->status = M2M2_APP_COMMON_STATUS_STREAM_STARTED;
    }
  p_resp_payload->stream = M2M2_ADDR_MED_EDA_STREAM;
  p_resp_payload->num_subscribers = g_state_eda.num_subs;
  p_resp_payload->num_start_reqs = g_state_eda.num_starts;
  p_resp_pkt->src = p_pkt->dest;
  p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 *@brief      Set DFT number for eda application
 *@param      pPkt: pointer to the packet structure
 *@return     m2m2_hdr_t
 ******************************************************************************/
static m2m2_hdr_t *eda_app_dft_num_set(m2m2_hdr_t *p_pkt) {
  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, eda_app_set_dft_num_t, p_in_payload);

  /* Allocate memory to the response packet payload */
  PKT_MALLOC(p_resp_pkt, eda_app_set_dft_num_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, eda_app_set_dft_num_t, p_resp_payload);

    /* Copy dft number from payload if valid setting  */
     /* supported dft numbers are 4,8,16,32 */
    if (p_in_payload->dftnum <= DFTNUM_64) {
      NRF_LOG_INFO("Valid dft num sel");
      eda_user_applied_dftnum = 1;
      AppEDACfg.DftNum = p_in_payload->dftnum;
    } else {
      /* default DFT number value */
      AppEDACfg.DftNum = DFTNUM_16;
    }

    p_resp_payload->command = M2M2_EDA_APP_CMD_SET_DFT_NUM_RESP;
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
    p_resp_payload->dftnum = p_in_payload->dftnum;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 *@brief      Perform dynamic scaling
 *@param      pPkt: pointer to the packet structure
 *@return     m2m2_hdr_t
 ******************************************************************************/
static m2m2_hdr_t *eda_app_dynamic_scaling(m2m2_hdr_t *p_pkt) {
  PYLD_CST(p_pkt, eda_app_dynamic_scale_t, p_in_payload);

  /* allocate memory for response payload */
  PKT_MALLOC(p_resp_pkt, eda_app_dynamic_scale_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, eda_app_dynamic_scale_t, p_resp_payload);
    p_resp_payload->command = M2M2_EDA_APP_CMD_DYNAMIC_SCALE_RESP;
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;


    /* rtia autoscale */
    AppEDACfg.RtiaAutoScaleEnable = p_in_payload->dscale ? bTRUE : bFALSE;
    if (AppEDACfg.RtiaAutoScaleEnable) {
      AppEDACfg.RtiaAutoScaleMin = p_in_payload->minscale;
      AppEDACfg.RtiaAutoScaleMax = p_in_payload->maxscale;
      AppEDACfg.LptiaRtiaSel = p_in_payload->lprtia;
      eda_user_applied_rtia_cal = 1;
    } else {
      AppEDACfg.LptiaRtiaSel = LPTIARTIA_100K;
      eda_user_applied_rtia_cal = 0;
    }
    NRF_LOG_INFO("autoscale=%d,autoscalemin=%d,autoscalemax=%d,lprtiasel=%d",
        AppEDACfg.RtiaAutoScaleEnable, AppEDACfg.RtiaAutoScaleMin,
        AppEDACfg.RtiaAutoScaleMax, AppEDACfg.LptiaRtiaSel);

    p_resp_payload->dscale = p_in_payload->dscale;
    p_resp_payload->minscale = p_in_payload->minscale;
    p_resp_payload->maxscale = p_in_payload->maxscale;
    p_resp_payload->lprtia = p_in_payload->lprtia;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 *@brief      Eda stream START/STOP/SUBSCRIBE/UNSUBSCRIBE options
 *@param      pPkt: pointer to the packet structure
 *@return     m2m2_hdr_t
 ******************************************************************************/
static m2m2_hdr_t *eda_app_stream_config(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  M2M2_APP_COMMON_CMD_ENUM_t command;
  int32_t nRetCode = EDA_SUCCESS;
  PYLD_CST(p_pkt, m2m2_app_common_sub_op_t, p_in_payload);
  PKT_MALLOC(p_resp_pkt, m2m2_app_common_sub_op_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_app_common_sub_op_t, p_resp_payload);
    switch (p_in_payload->command) {
    case M2M2_APP_COMMON_CMD_STREAM_START_REQ:
      gnAd5940App = AD5940_APP_EDA;
      reset_eda_packetization();
      if (g_state_eda.num_starts == 0) {
#ifdef EXTERNAL_TRIGGER_EDA
        eda_start_req = 1; /* eda app to start */
#endif
#ifdef USER0_CONFIG_APP
      get_eda_app_timings_from_user0_config_app_lcfg(&eda_app_timings.start_time,\
                                        &eda_app_timings.on_time, &eda_app_timings.off_time);
      if(eda_app_timings.start_time > 0)
      {
        eda_app_timings.delayed_start = true;
      }
      //EDA app not in continuous mode & its interval operation mode
      if(!is_eda_app_mode_continuous() && !(get_low_touch_trigger_mode3_status()))
      {
        start_eda_app_timer();
      }

      if(!eda_app_timings.delayed_start)
      {
        nRetCode = EDAAppInit();
        eda_app_timings.app_mode_on = true;
      }
      if(EDA_SUCCESS == nRetCode) {
#else
      if(EDA_SUCCESS == EDAAppInit()) {
#endif// USER0_CONFIG_APP
        //if (EDAAppInit() == EDA_SUCCESS) {
          g_state_eda.num_starts = 1;
#ifdef DEBUG_EDA
          eda_start_time = MCU_HAL_GetTick();
          pkt_count = 0;
#endif
          status = M2M2_APP_COMMON_STATUS_STREAM_STARTED;
        } else {
          status = M2M2_APP_COMMON_STATUS_STREAM_NOT_STARTED;
        }
      } else {
        g_state_eda.num_starts++;
        status = M2M2_APP_COMMON_STATUS_STREAM_IN_PROGRESS;
      }
      command = M2M2_APP_COMMON_CMD_STREAM_START_RESP;
      break;

    case M2M2_APP_COMMON_CMD_STREAM_STOP_REQ:
      if (g_state_eda.num_starts == 0) {
        status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
      } else if (g_state_eda.num_starts == 1) {
#ifdef EXTERNAL_TRIGGER_EDA
        eda_start_req = 0;/* eda app to stop */
#endif
        if (EDAAppDeInit()) {
          g_state_eda.num_starts = 0;
          status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
#ifdef USER0_CONFIG_APP
          if(eda_app_timings.check_timer_started)
          {
            eda_timer_stop();
            eda_app_timings.on_time_count = 0;
            eda_app_timings.off_time_count = 0;
            eda_app_timings.start_time_count = 0;
            eda_app_timings.delayed_start =  false;
          }
#endif//USER0_CONFIG_APP
        } else {
          g_state_eda.num_starts = 1;
          status = M2M2_APP_COMMON_STATUS_ERROR;
        }
      } else {
        g_state_eda.num_starts--;
        status = M2M2_APP_COMMON_STATUS_STREAM_COUNT_DECREMENT;
      }
      command = M2M2_APP_COMMON_CMD_STREAM_STOP_RESP;
      break;

    case M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_REQ:
      g_state_eda.num_subs++;
      if(g_state_eda.num_subs == 1)
      {
         /* reset pkt sequence no. only during 1st sub request */
         g_state_eda.data_pkt_seq_num = 0;
      }
      post_office_setup_subscriber(
          M2M2_ADDR_MED_EDA, M2M2_ADDR_MED_EDA_STREAM, p_pkt->src, true);
      status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_ADDED;
      command = M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_RESP;
      break;
    case M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_REQ:
      if (g_state_eda.num_subs <= 1) {
        g_state_eda.num_subs = 0;
        status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_REMOVED;
      } else {
        g_state_eda.num_subs--;
        status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_COUNT_DECREMENT;
      }
      post_office_setup_subscriber(
          M2M2_ADDR_MED_EDA, M2M2_ADDR_MED_EDA_STREAM, p_pkt->src, false);
      command = M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_RESP;
      break;
    default:
      /* Something has gone horribly wrong.*/
      post_office_consume_msg(p_resp_pkt);
      return NULL;
    }
    p_resp_payload->command = command;
    p_resp_payload->status = status;
    p_resp_payload->stream = p_in_payload->stream;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  } // if(NULL != p_resp_pkt)
  return p_resp_pkt;
}

#ifdef PROFILE_TIME_ENABLED
uint32_t eda_de_init_diff_time;
#endif
/*!
 ****************************************************************************
 * @brief  Eda App Deinitialization
 * @param  None
 * @return ECG_ERROR_CODE_t: Success/Error
 *****************************************************************************/
EDA_ERROR_CODE_t EDAAppDeInit() {
  if(init_flag)
  {
#ifdef PROFILE_TIME_ENABLED
  uint32_t eda_de_init_start_time = get_micro_sec();
#endif
  NRF_LOG_DEBUG("Stop EDA measurement right now!!\n");
  if (measurement_cycle_completed) {
    AD5940_LPModeClkS(
        LPMODECLK_HFOSC); /* Trigger switching system clock to 32kHz */
    AppEDACtrl(APPCTRL_STOPSYNC, 0);
    AppEDACtrl(APPCTRL_STOPSYNC, 0); /* to make sure it is completely stopped */
  }

#ifdef EXTERNAL_TRIGGER_EDA
  disable_ad5940_ext_trigger(AppEDACfg.EDAODR);
#endif

  ad5940_port_deInit();

  /* de initing for next use */
  init_flag=0;

  /* de init power */
  adp5360_enable_ldo(ECG_LDO, false);
  NRF_LOG_DEBUG("EDA Sensor stopped!!");
#ifdef PROFILE_TIME_ENABLED
  eda_de_init_diff_time = get_micro_sec() - eda_de_init_start_time;
#endif
  }
  return EDA_SUCCESS;
}

/*!
 ****************************************************************************
 * @brief    Example of how to write an LCFG parameter
 * @param    field: LCFG field that has to be written
 * @param    value: Value to be written
 * @retval   EDA_ERROR_CODE_t
 *****************************************************************************/
EDA_ERROR_CODE_t EDAWriteLCFG(uint8_t field, uint16_t value) {
  AppEDACfg_Type *pCfg;
  AppEDAGetCfg(&pCfg);
  if (field < EDA_LCFG_MAX) {
    switch (field) {
    case EDA_LCFG_FS: /* field = 0 */
      pCfg->EDAODR = value;
      eda_user_applied_odr = 1;
      break;
    case EDA_LCFG_DFT_NUM: /* field = 2 */
      pCfg->DftNum = value;
      eda_user_applied_dftnum = 1;
      break;
    }
    return EDA_SUCCESS;
  }
  return EDA_ERROR;
}

/*!
 ****************************************************************************
 * @brief    Read LCFG parameter
 * @param    index: LCFG field
 * @param    value: Returned corresponding LCFG value
 * @retval   EDA_ERROR_CODE_t
 *****************************************************************************/
EDA_ERROR_CODE_t EDAReadLCFG(uint8_t index, uint16_t *value) {
  AppEDACfg_Type *pCfg;
  AppEDAGetCfg(&pCfg);
  if (index < EDA_LCFG_MAX) {
    switch (index) {
    case EDA_LCFG_FS: /* index = 0 */
      *value = (uint16_t)(pCfg->EDAODR);
      break;
    case EDA_LCFG_DFT_NUM: /* index = 2 */
      *value = pCfg->DftNum;
      break;
    }
    return EDA_SUCCESS;
  }
  return EDA_ERROR;
}

/*!
 ****************************************************************************
 * @brief  Eda App initialization
 * @param  None
 * @return EDA_ERROR_CODE_t
 *****************************************************************************/
EDA_ERROR_CODE_t EDAAppInit() {
#ifdef PROFILE_TIME_ENABLED
  eda_init_start_time = get_micro_sec();
#endif
   EDA_ERROR_CODE_t retVal = EDA_ERROR;
  fImpCar_Type EDABase = {
      .Real = 24368.6,
      .Image = -16.696,
  };
  /* power on */
  adp5360_enable_ldo(ECG_LDO, true);


  /* Init required */
  init_flag=1;

  /* start eda initialization */
  ad5940_eda_start();

  /* Control BIA measurment to start. Second parameter has no
   * meaning with this command. */
  AppEDACtrl(APPCTRL_START, 0);/* to disable running on wake up timer */
  AppEDACtrl(EDACTRL_SETBASE, &EDABase);
  ResistorForBaseline = 19900;
  retVal = EDA_SUCCESS;
#ifdef PROFILE_TIME_ENABLED
  eda_init_diff_time = get_micro_sec() - eda_init_start_time;
#endif
  return retVal;
}


/*!
 ****************************************************************************
 *@brief      Eda stream Read/write configuration options
 *@param      pPkt: pointer to the packet structure
 *@return     m2m2_hdr_t
 ******************************************************************************/
static m2m2_hdr_t *eda_app_reg_access(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  PYLD_CST(p_pkt, eda_app_lcfg_op_hdr_t, p_in_payload);
  /* Allocate a response packet with space for the correct number of operations
   */
  PKT_MALLOC(p_resp_pkt, eda_app_lcfg_op_hdr_t,
      p_in_payload->num_ops * sizeof(p_in_payload->ops[0]));
  if (NULL != p_resp_pkt) {
    PYLD_CST(p_resp_pkt, eda_app_lcfg_op_hdr_t, p_resp_payload);

