ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad5940_eda/eda_application_task.c
    switch (p_in_payload->command) {
    case M2M2_APP_COMMON_CMD_READ_LCFG_REQ:
      for (int i = 0; i < p_in_payload->num_ops; i++) {
        uint16_t reg_data = 0;
        if (EDAReadLCFG(p_in_payload->ops[i].field, &reg_data) == EDA_SUCCESS) {
          status = M2M2_APP_COMMON_STATUS_OK;
        } else {
          status = M2M2_APP_COMMON_STATUS_ERROR;
        }
        p_resp_payload->ops[i].field = p_in_payload->ops[i].field;
        p_resp_payload->ops[i].value = reg_data;
      }
      p_resp_payload->command =
          (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_APP_COMMON_CMD_READ_LCFG_RESP;
      break;
    case M2M2_APP_COMMON_CMD_WRITE_LCFG_REQ:
      for (int i = 0; i < p_in_payload->num_ops; i++) {
        if (EDAWriteLCFG(p_in_payload->ops[i].field,
                p_in_payload->ops[i].value) == EDA_SUCCESS) {
          status = M2M2_APP_COMMON_STATUS_OK;
        } else {
          status = M2M2_APP_COMMON_STATUS_ERROR;
        }
        p_resp_payload->ops[i].field = p_in_payload->ops[i].field;
        p_resp_payload->ops[i].value = p_in_payload->ops[i].value;
      }
      p_resp_payload->command =
          (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_APP_COMMON_CMD_WRITE_LCFG_RESP;
      break;
    default:
      /* Something has gone horribly wrong. */
      post_office_consume_msg(p_resp_pkt);
      return NULL;
    }
    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_payload->num_ops = p_in_payload->num_ops;
    p_resp_payload->status = status;
  }
  return p_resp_pkt;
}

#ifdef DEBUG_EDA
extern uint32_t eda_load_time_diff;
static m2m2_hdr_t *eda_app_debug_info(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_OK;
  uint32_t fifo_level = 0;
  PYLD_CST(p_pkt, m2m2_get_eda_debug_info_req_cmd_t, p_in_payload);
  PKT_MALLOC(p_resp_pkt, m2m2_get_eda_debug_info_resp_cmd_t, 0);
  PYLD_CST(p_resp_pkt, m2m2_get_eda_debug_info_resp_cmd_t, p_resp_payload);

  p_resp_payload->Interrupts_time_gap = eda_load_time_diff;
  p_resp_payload->rtia_calibration_time = eda_rtia_cal_diff_time / 1000000;
  p_resp_payload->delay_in_first_measurements = delay_in_first_measurement;
  p_resp_payload->packets_time_gap = time_elapsed_for_eda;
  p_resp_payload->first_voltage_measure_time =
      voltage_measurement_diff_time + delay_in_first_measurement;
  p_resp_payload->first_current_measure_time =
      current_measurement_diff_time + delay_in_first_measurement;
  p_resp_payload->voltage_measure_time_gap = voltage_cycles_diff_time;
  p_resp_payload->current_measure_time_gap = current_cycles_diff_time;
  p_resp_payload->EDA_Init_Time = eda_init_diff_time / 1000000;
  p_resp_payload->EDA_DeInit_Time = eda_de_init_diff_time;
  p_resp_payload->ad5940_fifo_overflow_status = get_fifostat(&fifo_level);
  p_resp_payload->ad5940_fifo_level = fifo_level;

  p_resp_payload->command = M2M2_EDA_APP_CMD_REQ_DEBUG_INFO_RESP;

  p_resp_payload->status = status;
  p_resp_pkt->dest = p_pkt->src;
  p_resp_pkt->src = p_pkt->dest;
  return p_resp_pkt;
}
#endif

/*!
 ****************************************************************************
 *@brief      Eda stream set decimation factor
 *@param      pPkt: pointer to the packet structure
 *@return     m2m2_hdr_t
 ******************************************************************************/
static m2m2_hdr_t *eda_app_decimation(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_OK;
  PYLD_CST(p_pkt, m2m2_sensor_common_decimate_stream_t, p_in_payload);
  PKT_MALLOC(p_resp_pkt, m2m2_sensor_common_decimate_stream_t, 0);
  if (NULL != p_resp_pkt) {
    PYLD_CST(p_resp_pkt, m2m2_sensor_common_decimate_stream_t, p_resp_payload);

    switch (p_in_payload->command) {
    case M2M2_SENSOR_COMMON_CMD_GET_STREAM_DEC_FACTOR_REQ:
      p_resp_payload->command =
          M2M2_SENSOR_COMMON_CMD_GET_STREAM_DEC_FACTOR_RESP;
      break;
    case M2M2_SENSOR_COMMON_CMD_SET_STREAM_DEC_FACTOR_REQ:
      g_state_eda.decimation_factor = p_in_payload->dec_factor;
      if (g_state_eda.decimation_factor == 0) {
        g_state_eda.decimation_factor = 1;
      }
      p_resp_payload->command =
          M2M2_SENSOR_COMMON_CMD_SET_STREAM_DEC_FACTOR_RESP;
      break;
    }
    p_resp_payload->status = status;
    p_resp_payload->dec_factor = g_state_eda.decimation_factor;
    p_resp_payload->stream = p_in_payload->stream;
    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->src = p_pkt->dest;
  }
  return p_resp_pkt;
}




#ifdef AD5940_REG_ACCESS
/*!
 ****************************************************************************
 *@brief      AD5940 stream Read/write configuration options
 *@param      pPkt: pointer to the packet structure
 *@return     m2m2_hdr_t
 ******************************************************************************/
m2m2_hdr_t *ad5940_app_reg_access(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  PYLD_CST(p_pkt, m2m2_sensor_common_reg_op_16_hdr_t, p_in_payload);
  PKT_MALLOC(p_resp_pkt, m2m2_sensor_common_reg_op_16_hdr_t,
      p_in_payload->num_ops * sizeof(p_in_payload->ops[0]));
  if (NULL != p_resp_pkt) {
    PYLD_CST(p_resp_pkt, m2m2_sensor_common_reg_op_16_hdr_t, p_resp_payload);
    uint32_t reg_data = 0;
    /*TODO: ad5940_port_deInit();
    // de init power
    adp5360_enable_ldo(ECG_LDO,false);*/
    switch (p_in_payload->command) {
    case M2M2_SENSOR_COMMON_CMD_READ_REG_16_REQ:
      for (int i = 0; i < p_in_payload->num_ops; i++) {
        reg_data = AD5940_ReadReg(p_in_payload->ops[i].address);
        status = M2M2_APP_COMMON_STATUS_OK;
        p_resp_payload->ops[i].address = p_in_payload->ops[i].address;
        p_resp_payload->ops[i].value = reg_data;
      }
      p_resp_payload->command =
          (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_SENSOR_COMMON_CMD_READ_REG_16_RESP;
      break;
    case M2M2_SENSOR_COMMON_CMD_WRITE_REG_16_REQ:
      for (int i = 0; i < p_in_payload->num_ops; i++) {
        AD5940_WriteReg((uint16_t)p_in_payload->ops[i].address,
            (uint32_t)p_in_payload->ops[i].value);
        status = M2M2_APP_COMMON_STATUS_OK;
        p_resp_payload->ops[i].address = p_in_payload->ops[i].address;
        p_resp_payload->ops[i].value = p_in_payload->ops[i].value;
      }
      p_resp_payload->command =
          (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_SENSOR_COMMON_CMD_WRITE_REG_16_RESP;
      break;
    default:
      // Something has gone horribly wrong.
      return NULL;
    }
    /*TODO: ad5940_port_deInit();
    // de init power
    adp5360_enable_ldo(ECG_LDO,false);*/
    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_payload->num_ops = p_in_payload->num_ops;
    p_resp_payload->status = status;
  }
  return p_resp_pkt;
}
#endif

///////////////////////////////////////////////////////////////////
#ifdef DCB
/*!
 ****************************************************************************
 * @brief    Gets the entire eda DCB configuration written in flash
 * @param    eda_dcb_data: pointer to dcb struct variable,
 *            in size of data in Double Word (32-bits)
 * @param    read_size: The size of the record to be returned to the user
 * @retval   EDA_ERROR_CODE_t: Status
 *****************************************************************************/
EDA_ERROR_CODE_t read_eda_dcb(uint32_t *eda_dcb_data, uint16_t *read_size) {
  EDA_ERROR_CODE_t dcb_status = EDA_ERROR;

  if (adi_dcb_read_from_fds(ADI_DCB_EDA_BLOCK_IDX, eda_dcb_data, read_size) ==
      DEF_OK) {
    dcb_status = EDA_SUCCESS;
  }
  return dcb_status;
}

/*!
 ****************************************************************************
 * @brief    Sets the entire eda DCB configuration in flash
 * @param    eda_dcb_data: pointer to dcb struct variable,
 *            in size of data in Double Word (32-bits)
 * @param    write_Size: The size of the record to be written
 * @retval   EDA_ERROR_CODE_t: Status
 *****************************************************************************/
EDA_ERROR_CODE_t write_eda_dcb(uint32_t *eda_dcb_data, uint16_t write_Size) {
  EDA_ERROR_CODE_t dcb_status = EDA_ERROR;

  if (adi_dcb_write_to_fds(ADI_DCB_EDA_BLOCK_IDX, eda_dcb_data, write_Size) ==
      DEF_OK) {
    dcb_status = EDA_SUCCESS;
  }
  return dcb_status;
}

/*!
 ****************************************************************************
 * @brief    Delete the entire eda DCB configuration in flash
 * @param    None
 * @retval   EDA_ERROR_CODE_t: Status
 *****************************************************************************/
EDA_ERROR_CODE_t delete_eda_dcb(void) {
  EDA_ERROR_CODE_t dcb_status = EDA_ERROR;

  if (adi_dcb_delete_fds_settings(ADI_DCB_EDA_BLOCK_IDX) == DEF_OK) {
    dcb_status = EDA_SUCCESS;
  }
  return dcb_status;
}

/*!
 ****************************************************************************
 * @brief    Set the dcb present flag
 * @param    set_flag: flag to set presence of dcb in flash
 * @retval   None
 *****************************************************************************/
void eda_set_dcb_present_flag(bool set_flag) {
  g_eda_dcb_Present = set_flag;
  NRF_LOG_INFO("EDA DCB present set: %s",
      (g_eda_dcb_Present == true ? "TRUE" : "FALSE"));
}

/*!
 ****************************************************************************
 * @brief    Get whether the dcb is present in flash
 * @param    None
 * @retval   bool: TRUE: dcb present, FALSE: dcb absent
 *****************************************************************************/
bool eda_get_dcb_present_flag(void) {
  NRF_LOG_INFO(
      "EDA DCB present: %s", (g_eda_dcb_Present == true ? "TRUE" : "FALSE"));
  return g_eda_dcb_Present;
}

/*!
 ****************************************************************************
 * @brief    Update the global dcb presence flag in flash
 * @param    None
 * @retval   None
 *****************************************************************************/
void eda_update_dcb_present_flag(void) {
  g_eda_dcb_Present = adi_dcb_check_fds_entry(ADI_DCB_EDA_BLOCK_IDX);
  NRF_LOG_INFO("Updated. EDA DCB present: %s",
      (g_eda_dcb_Present == true ? "TRUE" : "FALSE"));
}

/*!
 ****************************************************************************
 * @brief    Update the lcfg from dcb
 * @param    p_pkt: pointer to packet
 * @retval   m2m2_hdr_t
 *****************************************************************************/
static m2m2_hdr_t *eda_app_set_dcb_lcfg(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  PKT_MALLOC(p_resp_pkt, eda_app_dcb_lcfg_t, 0);
  if (NULL != p_resp_pkt) {
    PYLD_CST(p_resp_pkt, eda_app_dcb_lcfg_t, p_resp_payload);
    if (eda_get_dcb_present_flag() == true) {
      uint32_t eda_dcb[MAXEDADCBSIZE] = {'\0'};
      uint16_t size = MAXEDADCBSIZE;
      if (read_eda_dcb(eda_dcb, &size) == EDA_SUCCESS) {
        for (uint8_t i = 0; i < size; i++) {
          /*
          each eda_dcb array element stores field and value together in total 4
          bytes. field -> 1 Byte value -> 2 Bytes undefined -> 1 Byte for ex- if
          eda_dcb[i] = 0x00ABCDEF field = 0xAB Value = 0xCDEF not_used/undefined
          -> 0x00
          */
          /* doing right shift and then & operation to get field */
          uint8_t field = (eda_dcb[i] >> 16) & 0xFF;
          /* doing & operation to get value */
          uint16_t value = eda_dcb[i] & 0xFFFF;
          if (EDAWriteLCFG(field, value) == EDA_SUCCESS) {
            status = M2M2_APP_COMMON_STATUS_OK;
          } else {
            status = M2M2_APP_COMMON_STATUS_ERROR;
          }
        }
      } else {
        status = M2M2_APP_COMMON_STATUS_ERROR;
      }
    } else {
      /* Since this function is for setting dcb lcfg for eda,
        and because this is the case when dcb lcfg is not present,
        therefore error status given */
      status = M2M2_APP_COMMON_STATUS_ERROR;
    }
    p_resp_payload->status = status;
    p_resp_payload->command = M2M2_APP_COMMON_CMD_SET_LCFG_RESP;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 * @brief    Read the dcb configuration
 * @param    p_pkt: pointer to packet
 * @retval   m2m2_hdr_t
 *****************************************************************************/
static m2m2_hdr_t *eda_dcb_command_read_config(m2m2_hdr_t *p_pkt) {
  static uint16_t r_size = 0;
  uint32_t dcbdata[MAXEDADCBSIZE];
  M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;

  // Declare a pointer to access the input packet payload
  // PYLD_CST(p_pkt, m2m2_dcb_eda_data_t, p_in_payload);
  PKT_MALLOC(p_resp_pkt, m2m2_dcb_eda_data_t, 0);
  if (NULL != p_resp_pkt) {
    // Declare a pointer to the response packet payload
    PYLD_CST(p_resp_pkt, m2m2_dcb_eda_data_t, p_resp_payload);

